import AbstractComponent from "../../abstract-component";

const createAboutStudioTemplate = () => {
  return `<section class="about-studio">
      <h1 class="about-studio__head head">О нашей студии</h1>
         <p class="about-studio__text text">
            Студия Пилатес Body Balance - это место для Ваших эффективных тренировок.
         </p>
         <p class="about-studio__text text">
            Студия Body Balance - это уникальный проект, созданный для людей, которые хотят
            оставаться в хорошей физической форме и быть здоровыми.
         </p>
         <p class="about-studio__text text">
            Наша студия создана по лучшим международным стандартам. У нас представлены 
            как групповые классы (до 8 человек в группе), так и мини-группы (до 5 человек в классе). 
            Но изюминкой нашей студии являются персональные тренировки, которые проводятся на уникальном 
            оборудовании для Пилатес (Cadillac, Reformer, Ladder Barrel, Combo Chair), созданном американской 
            компанией Balanced Body, которая является лидером на мировом рынке.
         </p>
         <p class="about-studio__text text">
         В нашей студии есть все необходимые условия для того, чтобы Вы могли достичь гармонии души и тела!
      </p>
      <p class="about-studio__text text">
         Студия Body Balance - это студия осознанного тренинга, направленного на развитие гармонии тела 
         и сознания. Наши профессиональные тренеры помогут Вам создать красивое, подтянутое, а главное 
         здоровое тело, без изнурительных и выматывающих тренировок. Занимаясь в нашей студии Вы вернете 
         себе правильную природную осанку, забудете о болевых ощущениях в спине и шеи, научитесь двигаться 
         легко и грациозно, у Вас улучшится качество самих движений и соответственно качество жизни, ведь 
         «Здоровье - первая составляющая счастья», как говорил создатель метода Джозеф Пилатес.
      </p>
      <p class="about-studio__text text">
         Записывайтесь к нам на занятия и ощутите себя по новому!
      </p>
      <h2 class="about-studio__head head">О Пилатес</h2>
      <p class="about-studio__text text">
      Пилатес - это система эффективных упражнений, которые возвращают нас к природному состоянию тела, его легкости, свободе и пластичности движений. Главная цель занятий Пилатес - сделать тело грациозным, послушным и выносливым. Особое внимание в тренировках Пилатес уделяется соблюдению принципов Пилатес, а именно:
      </p>
      <h3>-	Дыхание</h3>
      <p class="about-studio__text text">
         В тренировках Пилатес дыхание интегрировано в каждое движение, чтобы сохранить 
         осознанность того, что мы делаем, а также чтобы улучшить поток кислорода в тканях 
         и повысить жизненную емкость легких.
      </p>
      <h3>-	Концентрация</h3>
      <p class="about-studio__text text">
         Концентрироваться, значит обращать внимание на то, что вы делаете, «присутствовать» и контролировать каждое движение.
      </p>
      <h3>- Контроль</h3>
      <p class="about-studio__text text">
         Упражнения Пилатес никогда не выполняются бездумно, потому что важно контролировать движения и усилия, которые совершает тело.
      </p>
      <h3>-	Центрирование</h3>
      <p class="about-studio__text text">
         Под центром в Пилатес понимаются мышцы живота и поясничной области, которые называются «силовой центр» или «Power House» Развитие сильного, стабильного и гибкого цента является одной из определяющих характеристик этого вида физических упражнений.
      </p>
      <h3>-	Точность</h3>
      <p class="about-studio__text text">
         Тело должно принимать заданное положение, а вы - хорошо понимать цель каждого упражнения. Чем точнее совершаются движения, тем большую пользу принесет упражнение. В точности заложен ключ к овладению Пилатес.
      </p>
      <h3>-	Поток (Плавность)</h3>
      <p class="about-studio__text text">
         Поток создает плавные изящные и функциональные движения, что уменьшает нагрузку на суставы и совершенствует паттерны движений, так, чтобы все тело двигалось плавно, задействуя нужные и правильные мышцы в каждом конкретном движении.
      </p>
      <h3>-	Выравнивание</h3>
      <p class="about-studio__text text">
         Понимание, развитие и поддержание правильного выравнивания тела имеет большое значение для каждого человека. В основе этого принципа лежит оптимальное распределение нагрузок на опорно-двигательный аппарат под воздействием силы тяжести. При оптимальном положении суставы и кости будут испытывать на себе меньшую нагрузку, что способствует улучшению осанки, повышению комфорта  и бОльшим физическим способностям.
      </p>
      <h3>-	Интеграция</h3>
      <p class="about-studio__text text">
         Занятия Пилатес - это не просто последовательность упражнений, а стиль жизни. Тренировки Пилатес помогают интегрировать движения в привычную жизнь, делая сами движения более качественными, улучшая тем самым качество жизни.
      </p>
      <h3>-	Релаксация (Расслабление)</h3>
      <p class="about-studio__text text">
         Умение освобождаться от лишнего напряжения в теле помогает нам найти легкость и поток и в движениях, и в повседневной жизни.
         Эффект занятий напрямую зависит от глубины понимания этих простых на первый взгляд понятий-принципов. Они-то и составляют Магию Пилатеса. Не столь важно, какое движение (упражнение) Вы выполняете, важнее научиться осознанно использовать принципы движения по методу Пилатеса в повседневной жизни, и тогда Вы в полной мере ощутите на себе всю пользу тренировок Пилатес.
      </p>
      <h2 class="about-studio__head head">Кому нужен Пилатес?</h2>
      <p class="about-studio__text text">
         Этот метод настолько уникален и универсален, что подходит абсолютно всем, не зависимо от пола, возраста и физической подготовленности. Особенно рекомендован людям, которые ведут малоподвижный образ жизни, у кого есть болевые ощущения в спине и шеи, людям с нездоровой осанкой и сколиозом, людям в период восстановления после травм, людям с проблемами сердечно-сосудистой системой и нарушениями опорно-двигательного аппарата, а также тем, кто просто хочет иметь красивое, подтянутое, а главное здоровое тело!
      </p>
      <h2 class="about-studio__head head">Польза от Пилатес</h2>
      <p class="about-studio__text text">
         Благодаря регулярным занятиям Пилатес стабилизируется поясничный отдел позвоночника, укрепляются мышцы живота, снимается напряжение с мышц в области шеи, плеч и затылка, улучшается подвижность суставов, координация и осанка, увеличивается мышечная сила, уменьшается стресс, улучшается здоровье в целом, тело и разум приходят в состояние гармонии. Тренировки Пилатес нацелены на улучшение качества движений, так чтобы результаты ощущались в повседневной жизни. А Вы уже успели оценить эффективность Пилатес?
      </p>
   </section>
      `;
};

export default class AboutStudio extends AbstractComponent {
  getTemplate() {
    // возвращает разметку
    return createAboutStudioTemplate();
  }
}
